Revit 2024 API
TableSectionData.RemoveColumn Method
 Removes a column data at a specified index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void RemoveColumn(
	int nIndex
)
Visual Basic
Public Sub RemoveColumn ( _
	nIndex As Integer _
)
Visual C++
public:
void RemoveColumn(
	int nIndex
)
Parameters
nIndex
Type: System.Int32
 An integer index
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  nIndex is invalid index.
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace